[
    "What does a nosey pepper do? Gets jalapeno business!",
    "What do you call a fake noodle?  An Impasta",
    "What do you call an alligator in a vest?  An Investigator",
    "What happens if you eat yeast and shoe polish? Every morning you'll rise and shine!",
    "\"What's the difference between a guitar and a fish?\" \"You can't tuna fish.\"",
    "What do you call a baby monkey? A Chimp off the old block.",
    "Did you hear about the race between the lettuce and the tomato?  The lettuce was a \"head\" and the tomato was trying to \"ketchup\"!",
    "Did you hear about the hungry clock? It went back four seconds.",
    "What do you call a boy who finally stood up to the bullies? An ambulance.",
    "Why can't you give Elsa a balloon? Because she will Let it go.",
    "What do you get from a pampered cow? Spoiled milk.",
    "If Mississippi bought Virginia a New Jersey, what would Delaware? Idaho... Alaska!",
    "Did you hear about that new broom?  It's sweeping the nation!",
    "What do you call an elephant that doesn't matter?  An irrelephant.",
    "What do lawyers wear to court? Lawsuits!",
    "What gets wetter the more it dries? A towel.",
    "Why did the belt get arrested? He held up a pair of pants.",
    "What do you call a fat psychic?  A four chin teller.",
    "What do you call a computer floating in the ocean? A Dell Rolling in the Deep.",
    "What did Bacon say to Tomato?  Lettuce get together!",
    "What do you call a computer that sings? A-Dell",
    "Did you hear about the shampoo shortage in Jamaica? It's dread-full.",
    "How do you make a tissue dance? Put a little boogey in it!",
    "What is heavy forward but not backward? Ton.",
    "What do you call a gangsta snowman? Froze-T",
    "What did the femur say to the patella? I kneed you.",
    "Why did the picture go to jail? Because it was framed.",
    "What do you call a three-footed aardvark?  a yardvark!",
    "What do you get when you cross fish and an elephant? Swimming trunks.",
    "Where do bees go to the bathroom? At the BP station!",
    "Who earns a living driving their customers away?  A taxi driver.",
    "What do you call a laughing jar of mayonnaise? LMAYO",
    "What do you call a dinosaur with a extensive vocabulary? a thesaurus.",
    "\"How do you shoot a killer bee?\" \"With a bee bee gun.\"",
    "How do you drown a Hipster? In the mainstream.",
    "What kind of jokes do you make in the shower? Clean Jokes!",
    "What did the baby corn say to the mama corn? \"Where's Popcorn?\"",
    "What do you call sad coffee? Despresso.",
    "How do you make holy water?  Boil the hell out of it!",
    "What happened to the dog that swallowed a firefly?  It barked with de-light!",
    "What stays in the corner and travels all over the world?  A stamp.",
    "What do you call a man with no body and just a nose?  Nobody nose.",
    "Why did the computer go to the doctor? Because it had a virus!",
    "Why are frogs so happy?  They eat whatever bugs them",
    "How do you make an Octupus laugh? With ten-tickles",
    "Why are pirates called pirates? Cause they arrrrr.",
    "What's the first bet that most people make in their lives? the alpha bet",
    "Q. What do you get when you cross a cow and a duck? A. Milk and quackers!",
    "How do you organize a space party? You planet!",
    "What did the leopard say after eating his owner?   Man, that hit the \"spot.\"",
    "What do you call a sleeping bull?   A bulldozer!",
    "What do you call security guards working outside Samsung shops? Guardians of the Galaxy.",
    "What do you call having your grandma on speed dial? Instagram.",
    "Why did the banana go to the Doctor? Because it was not peeling well",
    "Why is England the wettest country?   Because the queen has reigned there for years!",
    "What belongs to you but others use more? Your name",
    "Why do fish live in salt water?   Because pepper makes them sneeze!",
    "Why did the man put his money in the freezer? He wanted cold hard cash!",
    "What do you get when you cross a snowman with a vampire? Frostbite.",
    "What is the best day to go to the beach? Sunday, of course!",
    "Which is the building is the largest? The library because it has the most stories.",
    "What do you call an illegally parked frog? Toad.",
    "What bow can't be tied? A rainbow!",
    "What do you call a laughing motorcycle?  A Yamahahaha",
    "What season is it when you are on a trampoline? Spring time.",
    "Where did the computer go to dance? To a disc-o.",
    "What is pink, goes in hard and dry and comes out soft and wet? Bubble Gum.",
    "What has one head, one foot and four legs? A Bed",
    "What is the difference between a school teacher and a train? The teacher says spit your gum out and the train says \"chew chew chew\".",
    "Why did the birdie go to the hospital? To get a tweetment.",
    "Why did the cross-eyed teacher lose her job? Because she couldn't control her pupils?",
    "What do you call someone who is afraid of Santa? A Clausterphobic",
    "What three candies can you find in every school?  Nerds, DumDums, and smarties.",
    "What sound do porcupines make when they kiss?  Ouch",
    "Why was the guy looking for fast food on his friend? Because his friend said dinner is on me.",
    "Did you hear the joke about the roof? Never mind, it's over your head!",
    "What do you call a bee that lives in America? USB",
    "How do you make a tissue dance? Put a bogey in it.",
    "Why didn't the skeleton go to the dance? Because he had no-body to go with.",
    "How do crazy people go through the forest? They take the psycho path.",
    "Did you hear about the angry pancake?  He just flipped.",
    "What do prisoners use to call each other? Cell phones.",
    "What do you call a cow with a twitch?  Beef Jerky.",
    "Did you ever hear about that movie constipation?  It never came out.",
    "What Do You Call A Bear With No Teeth?  A Gummy Bear",
    "What do you get when you cross Sonic The Hedgehog and Curious George?  2 Fast 2 Curious",
    "Did you hear about the hairdresser? She dyed.",
    "What do you call a musician with problems?  a trebled man.",
    "Did you hear about the Italian chef that died? He pasta way.",
    "Where do snowmen keep their money? In snow banks.",
    "What do you call a very religious person that sleep walks?  a Roman Catholic",
    "Did you hear about the crab that went to the seafood disco? He pulled a muscle",
    "Did you hear about the carrot detective?  He got to the root of every case.",
    "Q. What did the tie say to the hat? A. You go on ahead and I'll hang around",
    "What washes up on very small beaches? Microwaves!",
    "What goes through towns, up & over hills, but doesn't move? The road!",
    "Did you hear about the guy who got hit in the head with a can of soda? He was lucky it was a soft drink.",
    "Why was there thunder and lightning in the lab? The scientists were brainstorming!",
    "What did Delaware? a New Jersey",
    "Why did Tony go out with a prune? Because he couldn't find a date!",
    "What did the little mountain say to the big mountain? Hi Cliff!",
    "Did you hear the one about the geologist? He took his wife for granite so she left him",
    "What did Winnie The Pooh say to his agent? Show me the honey!",
    "What did the man say to the wall? One more crack like that and I'll plaster ya!",
    "What do you get when you cross a fridge with a radio? Cool Music",
    "Why couldn't the pirate play cards? Because he was sitting on the deck!",
    "What's the difference between bird flu and swine flu?  If you have bird flu, you need tweetment. If you have swine flu, you need oink-ment.",
    "Why did the traffic light turn red? You would too if you had to change in the middle of the street!",
    "What did one elevator say to the other elevator? I think I'm coming down with something!",
    "What do you call a window that raps? 2PANEZ",
    "Why can't your nose be 12 inches long? Because then it would be a foot!",
    "What has four wheels and flies? A garbage truck!",
    "What starts with a P, ends with an E, and has a million letters in it? Post Office!",
    "What did the blanket say to the bed? Don't worry, I've got you covered!",
    "Why should you take a pencil to bed? To draw the curtains!",
    "What do you call a frozen dog? A pupsicle.",
    "What does the Lone Ranger say when he takes out the garbage? To the dump, to the dump, to the dump dump dump.",
    "How many books can you put in an empty backpack? One! After that its not empty!",
    "What kind of button won't unbutton? A bellybutton!",
    "What do you call an 80s synth pop band with a scoop of ice cream? Depeche a la Mode.",
    "Why do sea-gulls fly over the sea? Because if they flew over the bay they would be bagels!",
    "What dog keeps the best time? A watch dog.",
    "What do you call two fat people having a chat?  A heavy discussion",
    "Why did the tomato turn red? It saw the salad dressing!",
    "What do you get when you plant kisses? Tu-lips (two-lips)",
    "What did the daddy chimney say to the baby chimney? You are to little to smoke!",
    "What do you call a ghosts mom and dad? Transparents",
    "What did the grape do when it got stepped on? It let out a little wine!",
    "What do you call the new girl at the bank? The Nutella!",
    "What did the judge say when the skunk walked in the court room? Odor in the court.",
    "What did the fish say when he swam into the wall? Dam!",
    "Why don't skeletons fight each other? They don't have the guts.",
    "What do you call cheese that is not yours? Nacho Cheese",
    "What streets do ghosts haunt? Dead ends!",
    "Did you hear about the astronaut who stepped on chewing gum?  He got stuck in Orbit.",
    "What did the penny say to the other penny? We make perfect cents.",
    "Why did the man with one hand cross the road? To get to the second hand shop.",
    "Why did the boy sprinkle sugar on his pillow before he went to sleep? So he could have sweet dreams.",
    "Did you hear about the painter who was hospitalized?  Reports say it was due to too many strokes.",
    "Why did the robber take a bath? Because he wanted to make a clean getaway.",
    "What happens if life gives you melons?  Your dyslexic",
    "What did the judge say to the dentist? Do you swear to pull the tooth, the whole tooth and nothing but the tooth.",
    "Why did the boy tiptoe past the medicine cabinet? He didn't want to wake the sleeping pills!",
    "What goes up when the rain comes down? An umbrella.",
    "Why did the belt go to jail? Because it held up a pair of pants!",
    "Did you hear about the calendar thief? He got 12 months; they say his days are numbered",
    "What happens if life gives you melons? Your dyslexic",
    "What did one raindrop say to the other?  Two's company, three's a cloud",
    "Why did the balloon burst?  Because is saw a lolly pop",
    "Did you hear about the sick juggler?  They say he couldnt stop throwing up!",
    "What kind of driver never get a parking ticket? A screw driver",
    "What did the stamp say to the envelope? Stick with me and we will go places!",
    "Who can shave 10 times a day and still have a beard? A barber.",
    "What do you call a horse that can't lose a race? Sherbet",
    "What do you call a dentist in the army?  A drill sergeant",
    "What did the triangle say to the circle? Your pointless!",
    "Did you hear about the new Johnny Depp movie?  It's the one rated Arrrr!",
    "Why does a milking stool have only 3 legs?  Because the cow has the utter.",
    "What's easy to get into but hard to get out of? Trouble",
    "Why did the dinosaur cross the road?  Because the chicken joke wasn't invented yet.",
    "What kind of lights did Noah use on the Ark? Flood lights!",
    "Did you hear about the monster with five legs? His trousers fit him like a glove.",
    "Why don't you see giraffes in elementary school? Because they're all in High School!",
    "Which is the longest word in the dictionary? \"Smiles\", because there is a mile between each \"s\"!",
    "What happened to the wooden car with wooden wheels and wooden engine? it wooden go!",
    "Which month do soldiers hate most? The month of March!",
    "What did the painter say to the wall? One more crack like that and I'll plaster you!",
    "What do you call a Bee who is having a bad hair day?  A Frisbee.",
    "What kind of shorts do clouds wear? Thunderwear",
    "Why do golfers wear two pairs of pants? In case they get a hole in one!",
    "What do you call a magician on a plane?  A flying sorcerer!",
    "Why did the toilet paper roll down the hill? He wanted to get to the bottom.",
    "Who cleans the bottom of the ocean? A Mer-Maid",
    "Whens the best time to go to the dentist? Tooth-hurty",
    "What did one aspiring wig say to the other aspiring wig?  I wanna get a head!",
    "Did you hear about the paddle sale at the boat store? It was quite an oar deal.",
    "Why did Goofy put a clock under his desk? Because he wanted to work over-time!",
    "Do you know why diarrhea is hereditary?  Because it runs through your jeans.",
    "What would you do if I stole a kiss? Call the Police",
    "What do you call a South American girl who is always in a hurry? Urgent Tina",
    "Why did Johnny throw the clock out of the window? Because he wanted to see time fly!",
    "When do you stop at green and go at red? When you're eating a watermelon!",
    "What did the tailor think of her new job? It was sew sew.",
    "How did the farmer mend his pants? With cabbage patches!",
    "Why did the man lose his job at the orange juice factory? He couldn't concentrate!",
    "How do you repair a broken tomato? Tomato Paste!",
    "Why did the baby strawberry cry? Because his parents were in a jam!",
    "What did the hamburger name his daughter? Patty!",
    "What kind of egg did the bad chicken lay? A deviled egg!",
    "What kind of key opens the door on Thanksgiving? A turkey!",
    "Why did the cookie go to the hospital? He felt crummy!",
    "Why were the teacher's eyes crossed? She couldn't control her pupils!",
    "What do you call a guy who never farts in public?  A private tutor.",
    "What do you call a bear with no socks on? Bare-foot.",
    "What can you serve but never eat? A volleyball.",
    "What kind of shoes do all spies wear? Sneakers.",
    "Why did the soccer player bring string to the game? So he could tie the score.",
    "Why is a baseball team similar to a muffin? They both depend on the batter.",
    "What did the alien say to the garden? Take me to your weeder.",
    "What do you call two fat people having a chat? A heavy discussion.",
    "Did you hear about the two bed bugs who met in the mattress?  They got married in the spring.",
    "Why do watermelons have fancy weddings?  Because they cantaloupe.",
    "Have you heard the joke about the butter? I better not tell you, it might spread.",
    "How do baseball players stay cool? They sit next to their fans.",
    "Why was the math book sad? Because it had too many problems.",
    "What runs but doesn't get anywhere? A refrigerator.",
    "What is an astronaut's favorite place on a computer? The Space bar!",
    "What exam do young witches have to pass? A spell-ing test!",
    "What do you call a sheep with no head and no legs?  A cloud!",
    "Why did the boy eat his homework? Because his teacher said it was a piece of cake!",
    "Why is Basketball such a messy sport? Because you dribble on the floor!",
    "How do you communicate with a fish? Drop him a line!",
    "Where do sheep go to get haircuts? To the Baa Baa shop!",
    "What does a shark like to eat with peanut butter? Jellyfish!",
    "What do cats eat for breakfast? Mice Crispies!",
    "Why can't a leopard hide? Because he's always spotted!",
    "What do you give a dog with a fever? Mustard, its the best thing for a hot dog!",
    "What do you get when you cross a cat with a lemon? A sour puss!",
    "Why do birds fly south for the winter? Its easier than walking!",
    "What kind of key opens a banana? A monkey!",
    "Did you hear about the vampire bicycle that went round biting people's arms off?  It was a vicious cycle.",
    "How do you know that carrots are good for your eyesight? Have you ever seen a rabbit wearing glasses?",
    "Why does a hummingbird hum? It doesn't know the words!",
    "What did one plate say to the other? Dinners on me",
    "What do you call a pile of kittens a meowntain",
    "Why are some fish at the bottom of the ocean? Because they dropped out of school!",
    "What goes up and down but doesn't move? The temperature!",
    "Which weighs more, a ton of feathers or a ton of bricks? Neither, they both weigh a ton!",
    "Did you hear about the blonde who gave her cat a bath?  She still hasn't gotten all the hair off her tongue.",
    "What has one horn and gives milk A milk truck.",
    "Where do bulls get their messages? On a bull-etin board.",
    "What do bulls do when they go shopping? They CHARGE!",
    "What do you call a house that likes food? a Condoment!",
    "What runs but can't walk? The faucet!",
    "What kind of bed does a mermaid sleep in? A water bed!",
    "What kind of crackers do firemen like in their soup? Firecrackers!",
    "Why did the barber win the race? Because he took a short cut.",
    "Where do boats go when they get sick?  The dock",
    "What do you call leftover aliens? Extra Terrestrials.",
    "What's taken before you get it? Your picture.",
    "Whats the difference between roast beef and pea soup?  You can roast beef, but you cant pea soup!",
    "What concert costs 45 cents?  50 Cent featuring Nickleback.",
    "Can February March? No. But April May.",
    "Did you hear about the injured vegetable?  Some say he got beet.",
    "Why did the tree go to the dentist? To get a root canal.",
    "What is it called when a cat wins a dog show?  A CAT-HAS-TROPHY!",
    "Why was the broom late? It over swept!",
    "What caused the airline to go bankrupt? Runway inflation.",
    "What do you call a snowman with a six pack?   An abdominal snowman.",
    "Did you hear the joke about the germ? Never mind. I don't want to spread it around",
    "What do you call a person that chops up cereal. a cereal killer.",
    "What do you call a crushed angle?  a rectangle",
    "Who do fish always know how much they weigh?  Because they have their own scales.",
    "Why didn't the 11 year old go to the pirate movie? because it was rated arrrrr",
    "What did the janitor say when he jumped out of the closet?  SUPPLIES!",
    "What did the tie say to the hat? You go on ahead and I'll hang around!",
    "Did you hear about the limo driver who went 25 years without a customer? All that time and nothing to chauffeur it.",
    "Why did the scarecrow win the nobel prize? Because he was outstanding in his field.",
    "What pet makes the loudest noise? A trum-pet!",
    "Did you hear about the kidnapping?  He woke up.",
    "What the difference between you and a calendar?  a calendar has dates.",
    "What do you call a rabbit with fleas?  Bugs Bunny!",
    "Why did the manager hire the marsupial? Because he was koala-fied.",
    "How many tickles does it take to make an octopus laugh? Tentacles.",
    "What do you get if you a cross a card game with a typhoon? Bridge over troubled water.",
    "Did you hear about the ghost comedian?  He was booed off stage.",
    "What do you get when you cross the Godfather with an attorney?  An offer you can't understand.",
    "What kind of emotions do noses feel? Nostralgia.",
    "Why did the dog cross the road? To get to the \"barking\" lot!",
    "How do spiders communicate? Through the World Wide Web.",
    "Why are chefs so mean? They beat eggs and whip cream.",
    "Did you hear about the guy who's whole left side was cut off?  He's all right now.",
    "Did you hear about the paper boy? He blew away",
    "What do you get when you cross Speedy Gonzales with a country singer?  Arriba McEntire.",
    "What do you get when you cross a lawyer with the Godfather?  An offer you can't understand.",
    "Did you hear about the circus fire? Yeah, it was in�tents�.",
    "Why did the scientist go to the tanning salon? Because he was a paleontologist.",
    "Why did the hot dog turn down a chance to star in a major motion picture?  None of the rolls (roles) were good enough.",
    "Did you hear about the new corduroy pillowcases?  Their making headlines...",
    "Q. What did the pink panther say when he stepped on the ant? A. deadant deadant deadant deadant.",
    "What kind of bird sticks to sweaters? a Vel-Crow.",
    "Music Teacher: What's your favourite musicle instrument? Fat Kid: The lunch bell",
    "Why did the two 4's skip lunch? They already 8 (ate).",
    "Why did the girl bring lipstick and eye shadow to school?  She had a make-up exam!",
    "Why did the insomniac man get arrested?  He resisted a rest",
    "Why did the music teacher need a ladder?  To reach the high notes.",
    "How does a suit put his child into bed? He tux him in",
    "What's the difference between a cat and a frog? A Cat has nine lives but a Frog croaks every night!",
    "What is a tree's favorite drink?  Root beer!",
    "Where does bad light go? To prism!",
    "What do sea monsters eat? Fish and ships",
    "lol = Drowning Man. *lol* = Drowning Cheerleader.",
    "Want to hear a dirty joke?   A kid jumped into a mud puddle.   Want to hear a clean joke?   A kid jumped into the bath.",
    "\"Two peanuts were walking down the street. One was asalted.\"",
    "I've just opened a new restaurant called Karma. There's no menu, we just give you what you deserve.",
    "I had a dream I was a muffler and I woke up exhausted.",
    "Today I gave my dead batteries away....Free of charge.",
    "Never give up on your dreams, keep sleeping.",
    "If you are running next to me on the treadmill, the answer is YES, we are racing.",
    "Being honest may not get you a lot of FRIENDS but it'll always get you the RIGHT ONES.",
    "I'm going to stand outside. So if anyone asks, I am outstanding.",
    "I am going bananas. Thats what i say to my bananas before i leave the house",
    "I'm so bright my mother calls me son.",
    "My eyelids are so sexy, I can't keep my eyes off them.",
    "The past, present and future walk into a bar. It was tense.",
    "What fits your schedule better......Exercising 1 hour a day or being fat 24 hours a day?",
    "Silence is golden, Duct tape is silver",
    "I know some jokes about unemployment but they need some work.",
    "I have never seen a fruit PUNCH  and a cereal  BOX",
    "If you think of a better fish pun. Let minnow.",
    "A three legged dog walks in the bar and says - \"I'm lookin' for the guy who shot my paw\"",
    "I tried to catch some fog earlier. I mist.",
    "Change is hard. Have you ever tried to bend a coin?",
    "If money dosnt grow on trees why do banks have branches?",
    "Did you hear about the farmer who fed his cows birdseed and started selling cheep milk",
    "A butcher goes on a first date and says 'It was nice meating you'",
    "two lumps of vomit are flying through the air one says to the other ''you look upset'' the other one says ''I know i was brought up around here.",
    "2 Pacs of Eminems for 50 Cents? Man that's Ludacris",
    "I can't believe I got fired from the calendar factory. All I did was take a day off.",
    "I wonder if earth makes fun of other planets for having no life.",
    "It's been scientifically proven that too many birthdays can kill you!",
    "Don't tell a secrets in a cornfield. There a too many ears",
    "Why do we cook bacon and bake cookies?",
    "Why do you drive down a parkway but park in a driveway?",
    "fi yuo cna raed tihs whit no porlbem, yuo aer smrat. Shaer ti whit yuor fienrds.",
    "I hated my job as an origami teacher. Too much paperwork.",
    "Why does no one on icarly have a dad?",
    "I love pressing F5. It's so refreshing.",
    "Why is everything delivered by a ship called cargo but if it's delivered by a car it's a shipment?",
    "Man delivers load of bubblewrap. Where do you want this he asks. Just pop it in the corner was the reply.",
    "I moustache you a question, but I'll shave it for later.",
    "\"When I die, I want my tombstone to be a WiFi hotspot......that way people visit more often.\"",
    "Why do they call it a hot water heater when you don't have to heat hot water?",
    "What happens when you get scared half to death twice?",
    "A police recruit was asked during the exam, \"What would you do if you had to arrest your own mother?\"  He said, \"Call for backup.\""
]